[
  {
    "title": "Interactive Portfolio Website",
    "date": "2025-08",
    "description": "Production-ready academic portfolio website with modern Next.js architecture, full-stack database integration, and AI-powered contact form",
    "tech": ["Next.js", "React", "TypeScript", "Tailwind CSS", "Supabase (PostgreSQL)", "Prisma", "Zod", "Resend", "GitHub Actions", "Vercel"],
    "repoURL": "https://github.com/TrevorMiller04/Personal_Portfolio",
    "liveUrl": "https://trevormiller.xyz",
    "longDescription": "<p>Built a production-oriented portfolio site with a modern <strong>Next.js + TypeScript strict-mode</strong> architecture and a responsive, accessible UI.</p><p>Implemented a full-stack backend using <strong>Supabase/PostgreSQL</strong> with <strong>Prisma</strong> models and <strong>Zod-validated API routes</strong> for safe request handling.</p><p>Shipped a contact pipeline that stores submissions, sends transactional emails via <strong>Resend</strong>, and generates constrained AI reply suggestions using deterministic rules layered on LLM output (intentionally designed to reduce hallucinations).</p><p>Added CI checks (lint/type/build) via <strong>GitHub Actions</strong> and deployed on <strong>Vercel</strong> with performance and maintainability as first-class concerns.</p>",
    "images": []
  },
  {
    "title": "Multitext Classification Model",
    "date": "2025-09",
    "description": "End-to-end NLP classification system using transformer architecture, deployed as AWS SageMaker endpoint with serverless API integration",
    "tech": ["PyTorch", "DistilBERT/Transformers", "AWS SageMaker", "AWS Lambda", "API Gateway", "Postman"],
    "longDescription": "<p>Completed an end-to-end applied machine learning project focused on building, customizing, deploying, and productionizing an <strong>NLP-based multiclass text classification system</strong> using modern transformer architectures.</p><p>Implemented a transformer-based classification pipeline by extending pre-trained <strong>DistilBERT</strong> with custom PyTorch layers (dropout, linear, ReLU) for sequence-level classification. Built custom training, validation, and evaluation loops applying transformer fundamentals: positional encodings, query–key–value attention, softmax normalization, and multi-head attention.</p><p>Productionized the system by deploying the trained model as a <strong>SageMaker-managed endpoint</strong>, developing custom inference scripts for real-time serving, and conducting load testing with <strong>SageMaker Inference Recommender</strong>. Exposed the endpoint via HTTP API using <strong>AWS Lambda</strong> and <strong>API Gateway</strong>, validating end-to-end inference with <strong>Postman</strong>.</p>",
    "images": [
      { "src": "/projects/multitext-classification/postman-response.png", "alt": "Postman API response showing model predictions with health probabilities", "caption": "Successful inference request with health classification probabilities (200 OK)" },
      { "src": "/projects/multitext-classification/lambda-architecture.png", "alt": "AWS Lambda function architecture diagram", "caption": "Production deployment architecture with API Gateway and Lambda integration" }
    ]
  },
  {
    "title": "Spotify Playlist Generator",
    "date": "2025-06",
    "description": "Python data pipeline transforming 95,000+ Spotify listening records into year-specific playlists via automated API integration",
    "tech": ["Python", "Pandas", "Spotify Web API"],
    "longDescription": "<p>Built a Python-based data pipeline that transforms raw Spotify personal listening history into structured datasets and automatically generates year-specific playlists using the <strong>Spotify Web API</strong>.</p><p>Implemented a data ingestion pipeline that parsed and flattened Spotify streaming history JSON files spanning <strong>2017–2025</strong>, processing <strong>95,572 playback records</strong> into structured Pandas DataFrames. Cleaned and normalized raw playback metadata, aggregated listening behavior at track and artist level, and designed configurable filtering logic based on listening time and play count thresholds.</p><p>Automated creation of year-specific Spotify playlists (ranging from dozens to <strong>700+ tracks</strong>) by integrating with the Spotify Web API using <strong>OAuth authentication</strong>. Implemented batched API operations with controlled delays to reduce rate-limit risk.</p>",
    "images": [
      { "src": "/projects/spotify-generator/playlist-view.png", "alt": "Spotify playlists created from 2017-2025 listening history", "caption": "Year-specific playlists generated from 95,000+ playback records (2017-2025)" }
    ]
  },
  {
    "title": "Spur Mobile Application",
    "date": "2025-05",
    "description": "Mobile app for short-notice social planning with AI-powered activity suggestions, built in a 4-person Agile/Scrum team",
    "tech": ["React Native", "Expo", "TypeScript", "OpenAI API", "Jira (Agile/Scrum)", "Node.js/Express", "PostgreSQL"],
    "longDescription": "<p>Built a mobile app in a 4-person <strong>Agile/Scrum</strong> team. Spur supports short-notice social planning (availability input, matching, event creation) with an AI-powered activity suggestion flow.</p><p>I owned the applied AI integration end-to-end: <strong>OpenAI API</strong> integration, prompt design with structured JSON outputs, guardrails/validation + fallback behavior, caching, and the UI flow that consumes suggestions.</p><p>I also delivered multiple core mobile screens and navigation improvements, plus location features (<strong>GPS/manual input</strong> and location-based filtering), and contributed to team execution by shaping Jira workflows and building lightweight <strong>Jira automation/agent commands</strong> to standardize story intake and updates.</p>",
    "images": []
  }
]
